app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `visitors`
JOIN `visitor_request_header` ON `visitor_request_header`.`id` = `visitors`.`request_header_id`
WHERE `visitors`.`status` = 'pending'
AND `visitors`.`visit_date` = '2025-12-26'
---
    public function index()
    {
         // Visits today
        $session = session();

        if (!$session->has('isLoggedIn') || !$session->has('user_id') || !$session->has('username') || !$session->has('role_id')) {
            header("Location: " . base_url('/login'));
            exit;
        }

        $today = date('Y-m-d');
        $roleId       = $_SESSION['role_id'];
        $userId       = $_SESSION['user_id'];
        $departmentId = $_SESSION['department_id'];
        $departmentName = $_SESSION['department_name'];
        // Dynamic counts from DB

        $pendingQuery = $this->visitorModel
        ->join(
        'visitor_request_header',
        'visitor_request_header.id = visitors.request_header_id'
        )
        ->where('visitors.status', 'pending')
        ->where('visitors.visit_date', $today);

        if ($roleId == 2) {
            $pendingQuery->where('visitor_request_header.department', $departmentName);
        } elseif ($roleId == 3) {
            $pendingQuery->where('visitors.created_by', $userId);
        }
        $pendingVisitors = $pendingQuery->countAllResults();

SELECT COUNT(*) AS `numrows` FROM `visitors`
---
        // $data['pendingList'] = $pendingList;


        $builder = $this->VisitorRequestHeaderModel
    ->select("
        visitor_request_header.id,
        visitor_request_header.header_code,
        visitor_request_header.purpose,
        visitor_request_header.requested_date,
        visitor_request_header.requested_time,
        visitor_request_header.total_visitors,
        visitor_request_header.description,
        visitor_request_header.status,
        GROUP_CONCAT(visitors.visitor_name SEPARATOR ', ') AS visitor_names
    ")