app/Controllers/Dashboard.php

    public function index()
    {

        $session = session();
        // Dynamic counts from DB
        $totalVisitors = $this->visitorModel->countAll(); // total rows

        $pendingIndents = $this->VisitorRequestHeaderModel
                            ->where('status', 'pending')
                            ->countAllResults();

        $approved = $this->VisitorRequestHeaderModel
                            ->where('status', 'approved')
                            ->countAllResults();

        $rejected = $this->VisitorRequestHeaderModel
                            ->where('status', 'rejected')
                            ->countAllResults();


        // Visits today
        $today = date('Y-m-d');
        $visitsToday = $this->VisitorRequestHeaderModel
                            ->where('requested_date', $today)
                            ->countAllResults();

        // Gate entries (from logs table?)
        $gateEntries = $this->SecurityGateLogModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `visitors`
SELECT COUNT(*) AS `numrows`
FROM `visitor_request_header`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `visitor_request_header`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `visitor_request_header`
WHERE `status` = 'rejected'
SELECT COUNT(*) AS `numrows`
FROM `visitor_request_header`
WHERE `requested_date` = '2025-12-10'
SELECT COUNT(*) AS `numrows` FROM `security_gate_logs`

$weekStart = date('Y-m-d 00:00:00', strtotime('monday this week'));
$weekEnd   = date('Y-m-d 23:59:59', strtotime('sunday this week'));

$weekVisitors = $this->SecurityGateLogModel
    ->where('check_in_time >=', $weekStart)
    ->where('check_in_time <=', $weekEnd)
    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `security_gate_logs`
WHERE `check_in_time` >= '2025-12-01 00:00:00'
AND `check_in_time` <= '2025-12-31 23:59:59'