app/Controllers/SecurityController.php

     public function View_authorized_visitor_list()
    {
          $deptModel = new DepartmentModel();
          $companyModel = new CompanyModel();
          $data['departments'] = $deptModel->findAll();
           $data['companies'] = $companyModel->findAll();
---
SELECT *
FROM `companies`