app/Controllers/SecurityController.php

     public function View_authorized_visitor_list()
    {
          $deptModel = new DepartmentModel();
    $data['departments'] = $deptModel->findAll();
---
SELECT *
FROM `departments`

public function checkIn()
{
    date_default_timezone_set('Asia/Kolkata');

    $log = new \App\Models\SecurityGateLogModel();
    $visitorModel = new \App\Models\VisitorRequestModel();

    $visitorId = $this->request->getPost('visitor_request_id');
    $v_code = $this->request->getPost('v_code');

    // Check if already checked-in
    $existing = $log->where('visitor_request_id', $visitorId)->first();
---
SELECT *
FROM `security_gate_logs`
WHERE `visitor_request_id` = '11'
 LIMIT 1