app/Controllers/User.php

SELECT *
FROM `departments`
---
    public function index()
    {
        $deptModel = new DepartmentModel();
        $data['departments'] = $deptModel->findAll();

SELECT *
FROM `departments`
SELECT *
FROM `roles`
---

    // Fetch data
    $data['users']       = $userModel->findAll();
    $data['departments'] = $deptModel->findAll();
    $data['roles']       = $roleModel->findAll();