app/Controllers/VisitorRequest.php

    public function visitorData()
    {
        $role = session()->get('role_id');
        $uid  = session()->get('user_id');

        $query = $this->visitorModel->orderBy('id', 'DESC');
          $query = $this->VisitorRequestHeaderModel->orderBy('id', 'DESC');


        if ($role == 3) {
            $query->where('requested_by', $uid);
        }

        return $this->response->setJSON($query->findAll());
---
SELECT *
FROM `visitor_request_header`
ORDER BY `id` DESC