app/Models/SecurityGateLogModel.php

    public function getRecentAuthorized($limit = 10)
    {
        return $this->select("
                    security_gate_logs.*,
                    visitors.visitor_name,
                    visitors.visitor_phone,
                    visitors.purpose,
                    visitors.v_code
                ")
                ->join('visitors', 'visitors.id = security_gate_logs.visitor_request_id', 'left')
                ->where('visitors.status', 'approved') // Only authorized
                ->orderBy('security_gate_logs.check_in_time', 'DESC')
                ->limit($limit)
                ->find();
---
SELECT `security_gate_logs`.*, `visitors`.`visitor_name`, `visitors`.`visitor_phone`, `visitors`.`purpose`, `visitors`.`v_code`
FROM `security_gate_logs`
LEFT JOIN `visitors` ON `visitors`.`id` = `security_gate_logs`.`visitor_request_id`
WHERE `visitors`.`status` = 'approved'
ORDER BY `security_gate_logs`.`check_in_time` DESC
 LIMIT 10